---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.ConnectionInputPointInfo
source: html/30746868-7caa-589e-b348-9f086a6c17e5.htm
---
# ConnectionInputPointInfo Properties

A index of the input member to which the restriction applies.